app/Services/PostsServices/Classes/GetOnePostService.php

select * from `posts` where `posts`.`id` = '1' limit 1
---
    public function getPostByID($id) {
        $post = Posts::find($id);